apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_cgm.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_mc_cgm.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_CGM_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_CGM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* MC_CGM Register Offsets **************************************************/

#define S32K3XX_MC_CGM_PCFS_SFDUR_OFFSET          (0x0000) /* PCFS Step Duration Register (PCFS_SDUR) */
#define S32K3XX_MC_CGM_PCFS_DIVC8_OFFSET          (0x0058) /* PCFS Divider Change 8 Register (PCFS_DIVC8) */
#define S32K3XX_MC_CGM_PCFS_DIVE8_OFFSET          (0x005c) /* PCFS Divider End 8 Register (PCFS_DIVE8) */
#define S32K3XX_MC_CGM_PCFS_DIVS8_OFFSET          (0x0060) /* PCFS Divider Start 8 Register (PCFS_DIVS8) */
#define S32K3XX_MC_CGM_MUX_0_CSC_OFFSET           (0x0300) /* Clock Mux 0 Select Control Register (MUX_0_CSC) */
#define S32K3XX_MC_CGM_MUX_0_CSS_OFFSET           (0x0304) /* Clock Mux 0 Select Status Register (MUX_0_CSS) */
#define S32K3XX_MC_CGM_MUX_0_DC_0_OFFSET          (0x0308) /* Clock Mux 0 Divider 0 Control Register (MUX_0_DC_0) */
#define S32K3XX_MC_CGM_MUX_0_DC_1_OFFSET          (0x030c) /* Clock Mux 0 Divider 1 Control Register (MUX_0_DC_1) */
#define S32K3XX_MC_CGM_MUX_0_DC_2_OFFSET          (0x0310) /* Clock Mux 0 Divider 2 Control Register (MUX_0_DC_2) */
#define S32K3XX_MC_CGM_MUX_0_DC_3_OFFSET          (0x0314) /* Clock Mux 0 Divider 3 Control Register (MUX_0_DC_3) */
#define S32K3XX_MC_CGM_MUX_0_DC_4_OFFSET          (0x0318) /* Clock Mux 0 Divider 4 Control Register (MUX_0_DC_4) */
#define S32K3XX_MC_CGM_MUX_0_DC_5_OFFSET          (0x031c) /* Clock Mux 0 Divider 5 Control Register (MUX_0_DC_5) */
#define S32K3XX_MC_CGM_MUX_0_DC_6_OFFSET          (0x0320) /* Clock Mux 0 Divider 6 Control Register (MUX_0_DC_6) */
#define S32K3XX_MC_CGM_MUX_0_DIV_TRIG_CTRL_OFFSET (0x0334) /* Clock Mux 0 Divider Trigger Control Register (MUX_0_DIV_TRIG_CTRL) */
#define S32K3XX_MC_CGM_MUX_0_DIV_TRIG_OFFSET      (0x0338) /* Clock Mux 0 Divider Trigger Register (MUX_0_DIV_TRIG) */
#define S32K3XX_MC_CGM_MUX_0_DIV_UPD_STAT_OFFSET  (0x033c) /* Clock Mux 0 Divider Update Status Register (MUX_0_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_1_CSC_OFFSET           (0x0340) /* Clock Mux 1 Select Control Register (MUX_1_CSC) */
#define S32K3XX_MC_CGM_MUX_1_CSS_OFFSET           (0x0344) /* Clock Mux 1 Select Status Register (MUX_1_CSS) */
#define S32K3XX_MC_CGM_MUX_1_DC_0_OFFSET          (0x0348) /* Clock Mux 1 Divider 0 Control Register (MUX_1_DC_0) */
#define S32K3XX_MC_CGM_MUX_1_DIV_UPD_STAT_OFFSET  (0x037c) /* Clock Mux 1 Divider Update Status Register (MUX_1_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_2_CSC_OFFSET           (0x0380) /* Clock Mux 2 Select Control Register (MUX_2_CSC) */
#define S32K3XX_MC_CGM_MUX_2_CSS_OFFSET           (0x0384) /* Clock Mux 2 Select Status Register (MUX_2_CSS) */
#define S32K3XX_MC_CGM_MUX_2_DC_0_OFFSET          (0x0388) /* Clock Mux 2 Divider 0 Control Register (MUX_2_DC_0) */
#define S32K3XX_MC_CGM_MUX_2_DIV_UPD_STAT_OFFSET  (0x03bc) /* Clock Mux 2 Divider Update Status Register (MUX_2_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_3_CSC_OFFSET           (0x03c0) /* Clock Mux 3 Select Control Register (MUX_3_CSC) */
#define S32K3XX_MC_CGM_MUX_3_CSS_OFFSET           (0x03c4) /* Clock Mux 3 Select Status Register (MUX_3_CSS) */
#define S32K3XX_MC_CGM_MUX_3_DC_0_OFFSET          (0x03c8) /* Clock Mux 3 Divider 0 Control Register (MUX_3_DC_0) */
#define S32K3XX_MC_CGM_MUX_3_DIV_UPD_STAT_OFFSET  (0x03fc) /* Clock Mux 3 Divider Update Status Register (MUX_3_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_4_CSC_OFFSET           (0x0400) /* Clock Mux 4 Select Control Register (MUX_4_CSC) */
#define S32K3XX_MC_CGM_MUX_4_CSS_OFFSET           (0x0404) /* Clock Mux 4 Select Status Register (MUX_4_CSS) */
#define S32K3XX_MC_CGM_MUX_4_DC_0_OFFSET          (0x0408) /* Clock Mux 4 Divider 0 Control Register (MUX_4_DC_0) */
#define S32K3XX_MC_CGM_MUX_4_DIV_UPD_STAT_OFFSET  (0x043c) /* Clock Mux 4 Divider Update Status Register (MUX_4_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_5_CSC_OFFSET           (0x0440) /* Clock Mux 5 Select Control Register (MUX_5_CSC) */
#define S32K3XX_MC_CGM_MUX_5_CSS_OFFSET           (0x0444) /* Clock Mux 5 Select Status Register (MUX_5_CSS) */
#define S32K3XX_MC_CGM_MUX_5_DC_0_OFFSET          (0x0448) /* Clock Mux 5 Divider 0 Control Register (MUX_5_DC_0) */
#define S32K3XX_MC_CGM_MUX_5_DIV_UPD_STAT_OFFSET  (0x047c) /* Clock Mux 5 Divider Update Status Register (MUX_5_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_6_CSC_OFFSET           (0x0480) /* Clock Mux 6 Select Control Register (MUX_6_CSC) */
#define S32K3XX_MC_CGM_MUX_6_CSS_OFFSET           (0x0484) /* Clock Mux 6 Select Status Register (MUX_6_CSS) */
#define S32K3XX_MC_CGM_MUX_6_DC_0_OFFSET          (0x0488) /* Clock Mux 6 Divider 0 Control Register (MUX_6_DC_0) */
#define S32K3XX_MC_CGM_MUX_6_DIV_UPD_STAT_OFFSET  (0x04bc) /* Clock Mux 6 Divider Update Status Register (MUX_6_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_7_CSC_OFFSET           (0x04c0) /* Clock Mux 7 Select Control Register (MUX_7_CSC) */
#define S32K3XX_MC_CGM_MUX_7_CSS_OFFSET           (0x04c4) /* Clock Mux 7 Select Status Register (MUX_7_CSS) */
#define S32K3XX_MC_CGM_MUX_7_DC_0_OFFSET          (0x04c8) /* Clock Mux 7 Divider 0 Control Register (MUX_7_DC_0) */
#define S32K3XX_MC_CGM_MUX_7_DIV_UPD_STAT_OFFSET  (0x04fc) /* Clock Mux 7 Divider Update Status Register (MUX_7_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_8_CSC_OFFSET           (0x0500) /* Clock Mux 8 Select Control Register (MUX_8_CSC) */
#define S32K3XX_MC_CGM_MUX_8_CSS_OFFSET           (0x0504) /* Clock Mux 8 Select Status Register (MUX_8_CSS) */
#define S32K3XX_MC_CGM_MUX_8_DC_0_OFFSET          (0x0508) /* Clock Mux 8 Divider 0 Control Register (MUX_8_DC_0) */
#define S32K3XX_MC_CGM_MUX_8_DIV_UPD_STAT_OFFSET  (0x053c) /* Clock Mux 8 Divider Update Status Register (MUX_8_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_9_CSC_OFFSET           (0x0540) /* Clock Mux 9 Select Control Register (MUX_9_CSC) */
#define S32K3XX_MC_CGM_MUX_9_CSS_OFFSET           (0x0544) /* Clock Mux 9 Select Status Register (MUX_9_CSS) */
#define S32K3XX_MC_CGM_MUX_9_DC_0_OFFSET          (0x0548) /* Clock Mux 9 Divider 0 Control Register (MUX_9_DC_0) */
#define S32K3XX_MC_CGM_MUX_9_DIV_UPD_STAT_OFFSET  (0x057c) /* Clock Mux 9 Divider Update Status Register (MUX_9_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_10_CSC_OFFSET          (0x0580) /* Clock Mux 10 Select Control Register (MUX_10_CSC) */
#define S32K3XX_MC_CGM_MUX_10_CSS_OFFSET          (0x0584) /* Clock Mux 10 Select Status Register (MUX_10_CSS) */
#define S32K3XX_MC_CGM_MUX_10_DC_0_OFFSET         (0x0588) /* Clock Mux 10 Divider 0 Control Register (MUX_10_DC_0) */
#define S32K3XX_MC_CGM_MUX_10_DIV_UPD_STAT_OFFSET (0x05bc) /* Clock Mux 10 Divider Update Status Register (MUX_10_DIV_UPD_STAT) */
#define S32K3XX_MC_CGM_MUX_11_CSC_OFFSET          (0x05c0) /* Clock Mux 11 Select Control Register (MUX_11_CSC) */
#define S32K3XX_MC_CGM_MUX_11_CSS_OFFSET          (0x05c4) /* Clock Mux 11 Select Status Register (MUX_11_CSS) */
#define S32K3XX_MC_CGM_MUX_11_DC_0_OFFSET         (0x05c8) /* Clock Mux 11 Divider 0 Control Register (MUX_11_DC_0) */
#define S32K3XX_MC_CGM_MUX_11_DIV_UPD_STAT_OFFSET (0x05fc) /* Clock Mux 11 Divider Update Status Register (MUX_11_DIV_UPD_STAT) */

/* Relative offset to S32K3XX_MC_CGM_MUX_X_CSC_OFFSET */

