apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_cgm.h
#define S32K3XX_MC_CGM_MUX_X_CSC_OFFSET           (0x0000) /* Clock Mux X Select Control Register (MUX_X_CSC) */
#define S32K3XX_MC_CGM_MUX_X_CSS_OFFSET           (0x0004) /* Clock Mux X Select Status Register (MUX_X_CSS) */
#define S32K3XX_MC_CGM_MUX_X_DC_0_OFFSET          (0x0008) /* Clock Mux X Divider 0 Control Register (MUX_X_DC_0) */
#define S32K3XX_MC_CGM_MUX_X_DIV_UPD_STAT_OFFSET  (0x003c) /* Clock Mux X Divider Update Status Register (MUX_X_DIV_UPD_STAT) */

/* MC_CGM Register Addresses ************************************************/

#define S32K3XX_MC_CGM_PCFS_SFDUR                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_PCFS_SFDUR_OFFSET)
#define S32K3XX_MC_CGM_PCFS_DIVC8                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_PCFS_DIVC8_OFFSET)
#define S32K3XX_MC_CGM_PCFS_DIVE8                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_PCFS_DIVE8_OFFSET)
#define S32K3XX_MC_CGM_PCFS_DIVS8                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_PCFS_DIVS8_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_1                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_1_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_2                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_2_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_3                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_3_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_4                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_4_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_5                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_5_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DC_6                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DC_6_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DIV_TRIG_CTRL        (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DIV_TRIG_CTRL_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DIV_TRIG             (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DIV_TRIG_OFFSET)
#define S32K3XX_MC_CGM_MUX_0_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_0_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_1_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_1_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_1_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_1_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_1_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_1_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_1_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_1_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_2_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_2_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_2_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_2_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_2_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_2_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_2_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_2_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_3_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_3_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_3_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_3_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_3_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_3_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_3_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_3_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_4_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_4_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_4_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_4_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_4_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_4_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_4_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_4_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_5_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_5_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_5_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_5_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_5_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_5_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_5_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_5_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_6_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_6_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_6_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_6_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_6_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_6_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_6_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_6_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_7_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_7_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_7_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_7_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_7_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_7_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_7_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_7_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_8_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_8_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_8_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_8_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_8_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_8_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_8_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_8_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_9_CSC                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_9_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_9_CSS                  (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_9_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_9_DC_0                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_9_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_9_DIV_UPD_STAT         (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_9_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_10_CSC                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_10_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_10_CSS                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_10_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_10_DC_0                (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_10_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_10_DIV_UPD_STAT        (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_10_DIV_UPD_STAT_OFFSET)
#define S32K3XX_MC_CGM_MUX_11_CSC                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_11_CSC_OFFSET)
#define S32K3XX_MC_CGM_MUX_11_CSS                 (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_11_CSS_OFFSET)
#define S32K3XX_MC_CGM_MUX_11_DC_0                (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_11_DC_0_OFFSET)
#define S32K3XX_MC_CGM_MUX_11_DIV_UPD_STAT        (S32K3XX_MC_CGM_BASE + S32K3XX_MC_CGM_MUX_11_DIV_UPD_STAT_OFFSET)

