apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_cgm.h
/* MC_CGM Register Bitfield Definitions *************************************/

/* PCFS Step Duration Register (PCFS_SDUR) */

#define MC_CGM_PCFS_SDUR_SHIFT            (0)       /* Bits 0-15: Step duration (SDUR) */
#define MC_CGM_PCFS_SDUR_MASK             (0xffff << MC_CGM_PCFS_SDUR_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* PCFS Divider Change 8 Register (PCFS_DIVC8) */

#define MC_CGM_PCFS_DIVC8_RATE_SHIFT      (0)       /* Bits 0-7: Divider change rate (RATE) */
#define MC_CGM_PCFS_DIVC8_RATE_MASK       (0xff << MC_CGM_PCFS_DIVC8_RATE_SHIFT)
                                                    /* Bits 8-15: Reserved */
#define MC_CGM_PCFS_DIVC8_INIT_SHIFT      (16)      /* Bits 16-31: Divider change initial value (INIT) */
#define MC_CGM_PCFS_DIVC8_INIT_MASK       (0xffff << MC_CGM_PCFS_DIVC8_INIT_SHIFT)

/* PCFS Divider End 8 Register (PCFS_DIVE8) */

#define MC_CGM_PCFS_DIVE8_DIVE_SHIFT      (0)       /* Bits 0-19: Divider end value (DIVE) */
#define MC_CGM_PCFS_DIVE8_DIVE_MASK       (0x0fffff << MC_CGM_PCFS_DIVE8_DIVE_SHIFT)
                                                    /* Bits 20-31: Reserved */

/* PCFS Divider Start 8 Register (PCFS_DIVS8) */

#define MC_CGM_PCFS_DIVS8_DIVS_SHIFT      (0)       /* Bits 0-19: Divider start value (DIVS) */
#define MC_CGM_PCFS_DIVS8_DIVS_MASK       (0x0fffff << MC_CGM_PCFS_DIVS8_DIVS_SHIFT)
                                                    /* Bits 20-31: Reserved */

/* Clock Mux n Divider n Control Register (MC_CGM_MUX_n_DC_n) */

#define MC_CGM_MUX_DC_DE                  (1 << 31)                                  /* Bit 31: Divider Enable (DE) */
#define MC_CGM_MUX_DC_DIV_SHIFT           (16)                                       /* Bit 16-19: Divider (DIV) */
#define MC_CGM_MUX_DC_DIV_MASK            (0xf << MC_CGM_MUX_DC_DIV_SHIFT)           /* Bit 16-19: Divider (DIV) */
#define MC_CGM_MUX_DC_DIV(n)              ((0xf & (n-1)) << MC_CGM_MUX_DC_DIV_SHIFT) /* Bit 16-19: Divider (DIV) */

/* Clock Mux n Select Control Register (MUX_n_CSC) */

#define MC_CGM_MUX_CSC_RAMPUP             (1 << 0)  /* Bit 0: PCFS ramp-up (RAMPUP) */
#define MC_CGM_MUX_CSC_RAMPDOWN           (1 << 1)  /* Bit 1: PCFS ramp-down (RAMPDOWN) */
#define MC_CGM_MUX_CSC_CLK_SW             (1 << 2)  /* Bit 2: Clock switch (CLK_SW) */
#define MC_CGM_MUX_CSC_CG                 (1 << 2)  /* Bit 2: Clock gate (CG) */
#define MC_CGM_MUX_CSC_SAFE_SW            (1 << 3)  /* Bit 3: Safe clock request (SAFE_SW) */
#define MC_CGM_MUX_CSC_FCG                (1 << 3)  /* Bit 3: Force clock gate (FCG) */
                                                    /* Bits 4-23: Reserved */

#define MC_CGM_MUX_CSC_SELCTL_SHIFT            (24) /* Bits 24-29: Clock source selection control (SELCTL) */
#define MC_CGM_MUX_0_CSC_SELCTL_MASK           (0x0f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_1_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_2_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_3_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_4_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_5_CSC_SELCTL_MASK           (0x3f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_6_CSC_SELCTL_MASK           (0x3f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_7_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_8_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_9_CSC_SELCTL_MASK           (0x1f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_10_CSC_SELCTL_MASK          (0x0f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_11_CSC_SELCTL_MASK          (0x0f << MC_CGM_MUX_CSC_SELCTL_SHIFT)
#define MC_CGM_MUX_CSC_SELCTL_FIRC             (0x00 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* FIRC */
#define MC_CGM_MUX_CSC_SELCTL_SIRC             (0x01 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* SIRC */
#define MC_CGM_MUX_CSC_SELCTL_FXOSC            (0x02 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* FXOSC */
#define MC_CGM_MUX_CSC_SELCTL_SXOSC            (0x04 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* SXOSC */
#define MC_CGM_MUX_CSC_SELCTL_PLL_PHI0_CLK     (0x08 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* PLL_PHI0_CLK */
#define MC_CGM_MUX_CSC_SELCTL_PLL_PHI1_CLK     (0x09 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* PLL_PHI1_CLK */
#define MC_CGM_MUX_CSC_SELCTL_CORE_CLK         (0x10 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* CORE_CLK */
#define MC_CGM_MUX_CSC_SELCTL_HSE_CLK          (0x13 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* HSE_CLK */
#define MC_CGM_MUX_CSC_SELCTL_AIPS_PLAT_CLK    (0x16 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* AIPS_PLAT_CLK */
#define MC_CGM_MUX_CSC_SELCTL_AIPS_SLOW_CLK    (0x17 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* AIPS_SLOW_CLK */
#define MC_CGM_MUX_CSC_SELCTL_EMAC_RMII_TX_CLK (0x18 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* EMAC_RMII_TX_CLK */
#define MC_CGM_MUX_CSC_SELCTL_EMAC_RX_CLK      (0x19 << MC_CGM_MUX_CSC_SELCTL_SHIFT) /* EMAC_RX_CLK */

                                                    /* Bits 30-31: Reserved */

/* Clock Mux n Select Status Register (MUX_n_CSS) */

#define MC_CGM_MUX_CSS_RAMPUP             (1 << 0)  /* Bit 0: PCFS ramp-up (RAMPUP) */
#define MC_CGM_MUX_CSS_RAMPDOWN           (1 << 1)  /* Bit 1: PCFS ramp-down (RAMPDOWN) */
#define MC_CGM_MUX_CSS_CLK_SW             (1 << 2)  /* Bit 2: Clock switch (CLK_SW) */
#define MC_CGM_MUX_CSS_SAFE_SW            (1 << 3)  /* Bit 3: Safe clock request (SAFE_SW) */
                                                    /* Bit 4-15: Reserved */
#define MC_CGM_MUX_CSS_SWIP               (1 << 16) /* Bit 16: Switch in progress (SWIP) */
#define MC_CGM_MUX_CSS_GRIP               (1 << 16) /* Bit 16: Grating request is in progress (GRIP) */
#define MC_CGM_MUX_CSS_SWTRG_SHIFT        (17)      /* Bits 17-19: Switch trigger cause (SWTRG) */
#define MC_CGM_MUX_CSS_SWTRG_MASK         (0x07 << MC_CGM_MUX_CSS_SWTRG_SHIFT)
#define MC_CGM_MUX_CSS_SWTRG_RQS          (0x01 << MC_CGM_MUX_CSS_SWTRG_SHIFT) /* Switch after request succeeded */
#define MC_CGM_MUX_CSS_SWTRG_RQFINT       (0x02 << MC_CGM_MUX_CSS_SWTRG_SHIFT) /* Switch after the request failed because of an inactive target clock and the current clock is FIRC */
#define MC_CGM_MUX_CSS_SWTRG_RQFINC       (0x03 << MC_CGM_MUX_CSS_SWTRG_SHIFT) /* Switch after the request failed because of an inactive current clock and the current clock is FIRC */
#define MC_CGM_MUX_CSS_SWTRG_SCRQ         (0x04 << MC_CGM_MUX_CSS_SWTRG_SHIFT) /* Switch to FIRC because of a safe clock request or reset succeeded */
#define MC_CGM_MUX_CSS_SWTRG_SCRQPI       (0x05 << MC_CGM_MUX_CSS_SWTRG_SHIFT) /* Switch to FIRC because of a safe clock request or reset succeeded, but the previous current clock source was inactive */

#define MC_CGM_MUX_CSS_CS                 (1 << 17) /* Bit 17: Clock status (CS) */
                                                    /* Bits 20-23: Reserved */

#define MC_CGM_MUX_CSS_SELSTAT_SHIFT            (24) /* Bits 24-29: Clock source selection status (SELSTAT) */
#define MC_CGM_MUX_0_CSS_SELSTAT_MASK           (0x0f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_1_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_2_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_3_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_4_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_5_CSS_SELSTAT_MASK           (0x3f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_6_CSS_SELSTAT_MASK           (0x3f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_7_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_8_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_9_CSS_SELSTAT_MASK           (0x1f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_10_CSS_SELSTAT_MASK          (0x0f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_11_CSS_SELSTAT_MASK          (0x0f << MC_CGM_MUX_CSS_SELSTAT_SHIFT)
#define MC_CGM_MUX_CSS_SELSTAT_FIRC             (0x00 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* FIRC */
#define MC_CGM_MUX_CSS_SELSTAT_SIRC             (0x01 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* SIRC */
#define MC_CGM_MUX_CSS_SELSTAT_FXOSC            (0x02 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* FXOSC */
#define MC_CGM_MUX_CSS_SELSTAT_SXOSC            (0x04 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* SXOSC */
#define MC_CGM_MUX_CSS_SELSTAT_PLL_PHI0_CLK     (0x08 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* PLL_PHI0_CLK */
#define MC_CGM_MUX_CSS_SELSTAT_PLL_PHI1_CLK     (0x09 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* PLL_PHI1_CLK */
#define MC_CGM_MUX_CSS_SELSTAT_CORE_CLK         (0x10 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* CORE_CLK */
#define MC_CGM_MUX_CSS_SELSTAT_HSE_CLK          (0x13 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* HSE_CLK */
#define MC_CGM_MUX_CSC_SELSTAT_AIPS_PLAT_CLK    (0x16 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* AIPS_PLAT_CLK */
#define MC_CGM_MUX_CSC_SELSTAT_AIPS_SLOW_CLK    (0x17 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* AIPS_SLOW_CLK */
#define MC_CGM_MUX_CSC_SELSTAT_EMAC_RMII_TX_CLK (0x18 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* EMAC_RMII_TX_CLK */
#define MC_CGM_MUX_CSC_SELSTAT_EMAC_RX_CLK      (0x19 << MC_CGM_MUX_CSS_SELSTAT_SHIFT) /* EMAC_RX_CLK */

                                                    /* Bits 30-31: Reserved */

/* Clock Mux 0 Divider Trigger Control Register (MUX_0_DIV_TRIG_CTRL) */

#define MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL   (1 << 0)  /* Bit 0: Trigger control (TCTL) */
                                                    /* Bits 1-30: Reserved */
#define MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN   (31 << 0) /* Bit 31: Halt handshake enable (HHEN) */

/* Clock Mux 0 Divider Trigger Register (MUX_0_DIV_TRIG) */

#define MC_CGM_MUX_0_DIV_TRIG_SHIFT       (0)       /* Bits 0-31: Trigger for divider update (TRIGGER) */
#define MC_CGM_MUX_0_DIV_TRIG_MASK        (0xffffffff << MC_CGM_MUX_0_DIV_TRIG_SHIFT)

/* Clock Mux n Divider Update Status Register (MUX_n_DIV_UPD_STAT) */

#define MC_CGM_MUX_DIV_UPD_STAT_DIV_STAT  (1 << 0)  /* Bit 0: Divider status for clock mux 0 (DIV_STAT) */
                                                    /* Bits 1-31: Reserved */

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_CGM_H */
